In [16]:
import psycopg2 as db
import pandas as pd
#não é a melhor pratica expor os dados de conexão. Mas aqui serão expostas pois é um dado de conhecimento comum.

# Trazendo as tabelas categoria e funcionario

In [17]:
conn = db.connect( 
    host="#####",
    user="#####",
    dbname="#####",
    password="######")
print("Connection established") 
categoria= pd.read_sql_query("SELECT * FROM public.categoria",conn)
funcionario= pd.read_sql_query("SELECT * FROM public.funcionario",conn)
#Normalizando as tabelas
categoria.rename(columns={'id':'id_categoria'},inplace=True)
funcionario.rename(columns={'id':'id_funcionario'},inplace=True)

display(categoria, funcionario)

Connection established

   id_categoria   nome_categoria
0             1         Babywear
1             2      Womens wear
2             3  Womens Footwear
3             4        Sportwear
4             5     Mens Clothes
5             6     Bath Clothes
6             7    Mens Footwear
7             8   Childrens wear

   id_funcionario  nome_funcionario
0               1       Rob Carsson
1               2       Eli Preston
2               3      Tom Lindwall
3               4        Leif Shine
4               5    Ingrid Hendrix
5               6  Lennart Skoglund
6               7      Rock Rollman
7               8      Helen Brolin
8               9      Joan Callins

# Conectando a Instancia_C e trazendo o maior id de venda

In [18]:
conn = db.connect( 
    host="#####",
    user="#####",
    dbname="#####",
    password="######")
ultima_venda_C = pd.read_sql_query("SELECT * FROM vendas_funcionario WHERE id_venda = ( SELECT MAX (id_venda) FROM vendas_funcionario);",conn)
print(ultima_venda_C)

   id_venda  data_venda  venda nome_funcionario  nome_categoria
0      1025  2022-02-20   9998     Joan Callins  Childrens wear

## Conectando na instancia_A e trazendo as novas vendas, com 'id_venda' maior do que os que estão registrados

In [19]:

conn = db.connect( 
    host="#####",
    user="#####",
    dbname="#####",
    password="######")
print("Connection established") 
vendas = pd.read_sql_query((f"SELECT *FROM public.venda WHERE id_venda > {int(ultima_venda_C['id_venda'])}"),conn)
vendas = vendas.merge(categoria,how='left',on='id_categoria')
vendas = vendas.merge(funcionario,how='left',on='id_funcionario')
vendas = vendas.loc[:,['id_venda','data_venda','venda','nome_funcionario','nome_categoria']]
display(vendas)

Connection established

Empty DataFrame
Columns: [id_venda, data_venda, venda, nome_funcionario, nome_categoria]
Index: []

# Conectando na Instancia_C para gravar os novos registros

In [20]:
conn = db.connect( 
    host="#####",
    user="#####",
    dbname="#####",
    password="######")
print("Connection established") 
cursor_C = conn.cursor() 
'''
for index, row in vendas.iterrows():
    print
    cursor_C.execute("INSERT INTO public.vendas_funcionario(id_venda, data_venda, venda, nome_funcionario, nome_categoria) VALUES(%s,%s,%s,%s,%s)",(row.id_venda, row.data_venda, row.venda,row.nome_funcionario,row.nome_categoria))
conn.commit()
cursor_C.close()
print('Done!')
'''
print(vendas)

Connection established
Empty DataFrame
Columns: [id_venda, data_venda, venda, nome_funcionario, nome_categoria]
Index: []